#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/posfiap/pos-fiap/runs/run-Wj44NkcQdVoyHYf3

Waiting for the plan to start...

Terraform v1.6.3
on linux_amd64
Initializing plugins and modules...
aws_ecs_cluster.ecs: Refreshing state... [id=arn:aws:ecs:us-east-1:027260563052:cluster/app_cluster]
aws_vpc.vpc: Refreshing state... [id=vpc-099d79c9b711b9949]
aws_ecr_repository.repo: Refreshing state... [id=app_repo]
aws_cloudwatch_log_group.techchallenge-logs: Refreshing state... [id=awslogs-techchallenge]
aws_iam_role.ecs_execution_role: Refreshing state... [id=ecsExecutionRole]
aws_iam_policy_attachment.ecs_execution_role_attachment: Refreshing state... [id=ecsExecutionRoleAttachment]
aws_ecs_task_definition.td: Refreshing state... [id=app]
aws_subnet.sn1: Refreshing state... [id=subnet-0ea79ee881b60d316]
aws_security_group.alb_sg: Refreshing state... [id=sg-017c659f97d8e37f7]
aws_subnet.sn2: Refreshing state... [id=subnet-01d546ab2bdf904ef]
aws_internet_gateway.gw: Refreshing state... [id=igw-055fb280a07759990]
aws_security_group.sg: Refreshing state... [id=sg-0b4a4fb69f345032f]
aws_lb_target_group.tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:027260563052:targetgroup/app-tg/922bfc32581d54a5]
aws_subnet.sn3: Refreshing state... [id=subnet-0749409cea446bef7]
aws_route_table.rt: Refreshing state... [id=rtb-0052f3b5468fb4eaa]
aws_lb.app_lb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:027260563052:loadbalancer/app/app-lb/36a5aa545b11f156]
aws_route_table_association.route3: Refreshing state... [id=rtbassoc-06996ad3c8470107d]
aws_route_table_association.route2: Refreshing state... [id=rtbassoc-0462be8184ee97015]
aws_route_table_association.route1: Refreshing state... [id=rtbassoc-0457766c10d1de1e8]
aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:us-east-1:027260563052:service/app_cluster/app_service]
aws_lb_listener.front_end: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:027260563052:listener/app/app-lb/36a5aa545b11f156/d25564c975c60047]
aws_lb_target_group.tg: Drift detected (update)
aws_security_group.sg: Drift detected (update)
aws_iam_role.ecs_execution_role: Drift detected (update)
aws_subnet.sn3: Drift detected (update)
aws_iam_policy_attachment.ecs_execution_role_attachment: Drift detected (update)
aws_vpc.vpc: Drift detected (update)
aws_internet_gateway.gw: Drift detected (update)
aws_subnet.sn2: Drift detected (update)
aws_lb_listener.front_end: Drift detected (update)
aws_ecs_task_definition.td: Drift detected (update)
aws_ecs_service.service: Drift detected (update)
aws_security_group.alb_sg: Drift detected (update)
aws_cloudwatch_log_group.techchallenge-logs: Drift detected (update)
aws_ecs_cluster.ecs: Drift detected (update)
aws_lb.app_lb: Drift detected (update)
aws_route_table.rt: Drift detected (update)
aws_subnet.sn1: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.service will be updated in-place
  ~ resource "aws_ecs_service" "service" {
        id                                 = "arn:aws:ecs:us-east-1:027260563052:service/app_cluster/app_service"
        name                               = "app_service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:027260563052:task-definition/app:21" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.td must be replaced
-/+ resource "aws_ecs_task_definition" "td" {
      ~ arn                      = "arn:aws:ecs:us-east-1:027260563052:task-definition/app:18" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:027260563052:task-definition/app" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - environment  = []
                  + healthCheck  = {
                      + command     = [
                          + "CMD-SHELL",
                          + "curl -f http://localhost:8080/actuator/health || exit 1",
                        ]
                      + interval    = 30
                      + retries     = 5
                      + startPeriod = 180
                      + timeout     = 5
                    }
                  - mountPoints  = []
                    name         = "app"
                  ~ portMappings = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - volumesFrom  = []
                    # (4 unchanged attributes hidden)
                },
            ]
        )
      ~ id                       = "app" -> (known after apply)
      ~ revision                 = 18 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.sn1 will be updated in-place
  ~ resource "aws_subnet" "sn1" {
        id                                             = "subnet-0ea79ee881b60d316"
      ~ tags                                           = {
          - "Name" = "app-03" -> null
        }
      ~ tags_all                                       = {
          - "Name" = "app-03"
        } -> (known after apply)
        # (15 unchanged attributes hidden)
    }

  # aws_subnet.sn2 will be updated in-place
  ~ resource "aws_subnet" "sn2" {
        id                                             = "subnet-01d546ab2bdf904ef"
      ~ tags                                           = {
          - "Name" = "app-01" -> null
        }
      ~ tags_all                                       = {
          - "Name" = "app-01"
        } -> (known after apply)
        # (15 unchanged attributes hidden)
    }

  # aws_subnet.sn3 will be updated in-place
  ~ resource "aws_subnet" "sn3" {
        id                                             = "subnet-0749409cea446bef7"
      ~ tags                                           = {
          - "Name" = "app-02" -> null
        }
      ~ tags_all                                       = {
          - "Name" = "app-02"
        } -> (known after apply)
        # (15 unchanged attributes hidden)
    }

  # aws_vpc.vpc will be updated in-place
  ~ resource "aws_vpc" "vpc" {
        id                                   = "vpc-099d79c9b711b9949"
      ~ tags                                 = {
          - "Name" = "Aplicação" -> null
        }
      ~ tags_all                             = {
          - "Name" = "Aplicação"
        } -> (known after apply)
        # (14 unchanged attributes hidden)
    }

Plan: 1 to add, 5 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @lucassoaresaraujo, Action: `pull_request`*